public_html/Books Review/The Practice of Programming/Errata for The Practice of Programming.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Errata for The Practice of Programming</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Errata for The Practice of Programming"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-30 15:26:58 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Errata for The Practice of Programming</h1>

<p><a href="http://cm.bell-labs.com/cm/cs/tpop/errata.html">http://cm.bell-labs.com/cm/cs/tpop/errata.html</a>
</p>
<p>
p39: Math.abs returns a negative value for Integer.MIN<sub>VALUE</sub>, so rand() should be return left + rgen.nextInt(right-left+1);
</p>
<p>
p74: As on p39, the call to rand should be int r = rand.nextInt(s.size());
</p>
<p>
p75: In Exercise 3-4, replace State by Prefix.
</p>
<p>
p87: The GET command should use CRLFs, as in puts $so "GET $q HTTP/1.0\r\n\r\n", though all servers seem to accept it without.
</p>
<p>
p95: In the diagram, <code>field[3]</code> should have the value (sline + 15), not (sline + 14). This also necessitates a change in shading.
</p>
<p>
p95: line should be updated immediately after a successful call of realloc to avoid a potential memory leak or corruption. Fixed on the source code page.
</p>
<p>
p100: Csv::getline can return false for the last line of a file if the line does not end with a newline. Adding an explicit test for str.length() fixes it.
</p>
<p>
p102: If the last character of a line is the closing quote of a quoted field in Csv::advquoted, j is incremented beyond the end of the string, causing an illegal reference. Testing ++j &lt; s.length() before accessing s[j] prevents this.
</p>
<p>
The first printing has minor typographical errors in the text on pages 146, 166, and 244.
</p>
<p>
p192: sizeof(char) is 1.
</p></div>

<div id="postamble">
<p class="date">Date: 2013-01-30 15:26:58 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
